# -*- coding: utf-8 -*-
# pylint: disable=C0301

'''
content for 语文 一年级 识字
'''
YU_WEN_SHIZI = {
    'title': '语文 一年级 识字',
    'user': 'Zhengyu',
    'template': 'textbook',
    'subject': 'chinese',
    'sections': [
        {
            'title': '汉语拼音',
            'exercises': [
                ('ɑ', '阿姨'),
                ('o', '我'),
                ('e', '饿'),
                ('i', '衣服'),
                ('u', '屋子'),
                ('ü', '鱼'),
                ('yi', ''),
                ('wu', ''),
                ('yu', ''),
                ('b', ''),
                ('p', ''),
                ('m', ''),
                ('f', ''),
                ('d', ''),
                ('t', ''),
                ('n', ''),
                ('l', ''),
                ('爸', 'bɑ̀'),
                ('妈', 'mā'),
                ('我', 'wǒ'),
                ('大', 'dɑ̀ 大米'),
                ('米', 'mǐ 大米'),
                ('土', 'tǔ 土地'),
                ('地', 'dì 土地'),
                ('马', 'mɑ̌ 大马'),
                ('g', ''),
                ('k', ''),
                ('h', ''),
                ('gua', ''),
                ('guo', ''),
                ('花', 'huɑ̄ 不开花'),
                ('哥', 'gē 哥哥'),
                ('弟', 'dì 弟弟'),
                ('个', 'gè 十个'),
                ('画', 'huɑ̀ 画画'),
                ('j', ''),
                ('q', ''),
                ('x', ''),
                ('jia', ''),
                ('xia', ''),
                ('qia', ''),
                ('ju', ''),
                ('xu', ''),
                ('qu', ''),
                ('下', 'xiɑ̀ 下来'),
                ('洗', 'xǐ 洗衣服'),
                ('衣', 'yī 洗衣服'),
                ('服', 'fú 洗衣服'),
                ('鸡', 'jī 小黄鸡'),
                ('z', ''),
                ('c', ''),
                ('s', ''),
                ('zh', ''),
                ('ch', ''),
                ('sh', ''),
                ('r', ''),
                ('zī', ''),
                ('cī', ''),
                ('sī', ''),
                ('zhī', ''),
                ('chī', ''),
                ('shī', ''),
                ('rī', ''),
                ('做', 'zuò 做错了'),
                ('过', 'guò 过桥'),
                ('了', 'lè 做错了'),
                ('不', 'bù 过不了'),
                ('乐', 'lè 快快乐乐'),
            ]
        },
    ]
}

'''
content for 语文 一年级 写字
'''
YU_WEN_XIEZI = {
    'title': '语文 一年级 写字',
    'user': 'Zhengyu',
    'template': 'textbook',
    'subject': 'chinese',
    'sections': [
        {
            'title': '识字一',
            'exercises': [
                ('一', ''),
                ('二', ''),
                ('三', ''),
            ]
        },
    ]
}
