# -*- coding: utf-8 -*-
# pylint: disable=C0301

'''
content for Yuwen Year 2
'''
YU_WEN_SHANG = {
    'title': '语文 二年级 上册',
    'user': 'Xinrong',
    'template': 'textbook',
    'subject': 'chinese',
    'sections': [
        {
            'title': '识字1',
            'text': [
                '金秋时节 景色宜人',
                '层林尽染 叠翠流金',
                '天高云淡 大雁南飞',
                '秋高气爽 山河壮美',
                '五谷丰登 瓜果飘香',
                '春华秋实 秋收冬藏'
            ],
            'learn': ['宜', '层', '尽', '染', '叠', '翠', '爽', '壮', '谷', '登', '华'],
            'write': ['宜', '色', '谷', '尽', '丰', '实', '华', '金', '层', '壮'],
            'read': ['尽力', '尽情', '爽快', '凉爽', '直爽', '翠绿', '翠竹', '壮丽', '壮观', '雄壮', '华灯', '华丽', '谷子', '稻谷', '山谷', '登山', '登高', '层叠', '楼层', '表层']
        },
    ]
}
